HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxPsi5s_regdef.h
/** \\brief  Baud Rate Timer/Reload Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_BG_Bits B;
} Ifx_PSI5S_BG;

/** \\brief  CPU Direct Write Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_CDW_Bits B;
} Ifx_PSI5S_CDW;

/** \\brief  Clock Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_CLC_Bits B;
} Ifx_PSI5S_CLC;

/** \\brief  Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_CON_Bits B;
} Ifx_PSI5S_CON;

/** \\brief  Channel Trigger Value Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_CTV_Bits B;
} Ifx_PSI5S_CTV;

/** \\brief  Frame Counter Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_FCNT_Bits B;
} Ifx_PSI5S_FCNT;

/** \\brief  Fractional Divider for Output CLK Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_FDO_Bits B;
} Ifx_PSI5S_FDO;

/** \\brief  PSI5-S Fractional Divider Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_FDR_Bits B;
} Ifx_PSI5S_FDR;

/** \\brief  Fractional Divider Register for Time Stamp */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_FDRT_Bits B;
} Ifx_PSI5S_FDRT;

/** \\brief  Fractional Divider Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_FDV_Bits B;
} Ifx_PSI5S_FDV;

/** \\brief  Global Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_GCR_Bits B;
} Ifx_PSI5S_GCR;

/** \\brief  Module Identification Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_ID_Bits B;
} Ifx_PSI5S_ID;

/** \\brief  Interrupt Node Pointer Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_INP_Bits B;
} Ifx_PSI5S_INP;

/** \\brief  Interrupt Node Pointer G Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_INPG_Bits B;
} Ifx_PSI5S_INPG;

/** \\brief  Interrupt Clear Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_INTCLR_Bits B;
} Ifx_PSI5S_INTCLR;

/** \\brief  Interrupt Clear Register G */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_INTCLRG_Bits B;
} Ifx_PSI5S_INTCLRG;

/** \\brief  Interrupt Enable Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_INTEN_Bits B;
} Ifx_PSI5S_INTEN;

/** \\brief  Interrupt Enable Register G */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_INTENG_Bits B;
} Ifx_PSI5S_INTENG;

/** \\brief  Interrupt Overview Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_INTOV_Bits B;
} Ifx_PSI5S_INTOV;

/** \\brief  Interrupt Set Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_INTSET_Bits B;
} Ifx_PSI5S_INTSET;

/** \\brief  Interrupt Set Register G */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_INTSETG_Bits B;
} Ifx_PSI5S_INTSETG;

/** \\brief  Interrupt Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_INTSTAT_Bits B;
} Ifx_PSI5S_INTSTAT;

/** \\brief  Interrupt Status Register G */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_INTSTATG_Bits B;
} Ifx_PSI5S_INTSTATG;

/** \\brief  Input and Output Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_IOCR_Bits B;
} Ifx_PSI5S_IOCR;

/** \\brief  Kernel Reset Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_KRST0_Bits B;
} Ifx_PSI5S_KRST0;

/** \\brief  Kernel Reset Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_KRST1_Bits B;
} Ifx_PSI5S_KRST1;

/** \\brief  Kernel Reset Status Clear Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_KRSTCLR_Bits B;
} Ifx_PSI5S_KRSTCLR;

/** \\brief  Number of Frames Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5S_NFC_Bits B;
} Ifx_PSI5S_NFC;

